# **Data Science Learners Hub**

**Module : SQL**

**Topic :** Data Manipulation Language (DML)

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

### **Data Manipulation Language (DML)** 

- In Microsoft SQL Server is a subset of SQL (Structured Query Language) that is focused on manipulating data stored in a database. DML operations primarily involve the insertion, updating, and deletion of data within database tables. The key SQL statements associated with DML are  \`INSERT\`, \`UPDATE\`, and \`DELETE\`.

- DML operations are fundamental to interacting with and managing the data within a relational database. They enable applications to add, modify, retrieve, and delete data, allowing for the dynamic manipulation of information stored in tables.

### **1\. INSERT Statement:**

- The \`INSERT\` statement is used to add new records (rows) to a table.
- It allows you to insert one or more rows of data into a specified table.

**Syntax:**

     INSERT INTO table\_name (column1, column2, ...)

     VALUES (value1, value2, ...);

**Explanation :**

- The **INSERT INTO** clause specifies the target table
- **table\_name**: The name of the table into which you want to insert data.
- **(column1, column2, ..., columnN)**: The list of columns in the table where you want to insert data. This part is optional, and if omitted, it implies that values will be inserted into all columns in the order they appear in the table.
- **VALUES (value1, value2, ..., valueN)**: The values to be inserted into the specified columns. The number of values must match the number of columns or be compatible with the column types.

**Note:**

- In Case of String values(for CHAR and VARCHAR datatypes) enclose it inside quotes
- Whenever u insert the data it should be in the same sequence
- One INSERT statement will insert only one record
- Every time an insert statement is executed a new record will be added to the table
- If u execute same INSERT statement lets say 5 times than 5 new records will be added to the table with same content
- Latest record will be appended at the end

In [2]:
USE DataScienceLearnersHub

In [9]:
CREATE TABLE Emp (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender VARCHAR(10),
    salary DECIMAL(10,2),
    department VARCHAR(50)
);

In [10]:
SELECT * FROM EMP

-- Note : The Emp table is empty as we have not inserted any data

In [11]:
-- Method 1 : Classic INSERT statement

INSERT INTO Emp (id, name, age, gender, salary, department)
VALUES (1, 'Rajesh', 30, 'Male', 60000.00, 'IT')

In [13]:
SELECT * FROM EMP

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT

In [14]:
-- Method 2 : Since we are inserting all the column values in sequence so no need to specify column name exclusively

INSERT INTO Emp VALUES (2, 'Padma', 25, 'Female', 55000.50, 'HR')

In [15]:
SELECT * FROM EMP

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR

In [16]:
-- Method 3 : Entering multiple row values in single INSERT statement

INSERT INTO Emp (id, name, age, gender, salary, department)
VALUES 
    (3, 'Laxman', 35, 'Male', 70000.75, 'Finance'),
    (4, 'Ganga', 28, 'Female', 48000.25, 'Marketing');

In [17]:
-- Creating one more table Emp_Temp similar to Emp table above

CREATE TABLE Emp_Temp (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender VARCHAR(10),
    salary DECIMAL(10,2),
    department VARCHAR(50)
);

In [18]:
SELECT * FROM Emp_Temp

In [20]:
INSERT INTO Emp_Temp (id, name, age, gender, salary, department)
VALUES 
    (5, 'Nikhil', 32, 'Male', 72000.00, 'IT'),
    (6, 'Sarita', 29, 'Female', 58000.75, 'HR'),
    (7, 'Bunny', 40, 'Male', 85000.50, 'Finance'),
    (8, 'Namrata', 26, 'Female', 50000.50, 'Marketing'),
    (9, 'Abhiram', 38, 'Male', 78000.25, 'IT'),
    (10, 'Tikram', 31, 'Female', 62000.00, 'Finance'),
    (11, 'Ramulu', 58, 'Male', 178000.25, 'IT'),
    (12, 'Bala', 51, 'Female', 162000.00, 'Finance');

In [21]:
SELECT * FROM Emp_Temp

id,name,age,gender,salary,department
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance

In [22]:
SELECT * FROM Emp

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing

In [23]:
-- Method 4 : Inserting values into Emp table using INSERT INTO SELECT statemet using Emp_Temp table

INSERT INTO Emp (id, name, age, gender, salary, department)
SELECT id, name, age, gender, salary, department
FROM Emp_Temp

In [24]:
SELECT * FROM Emp

-- Note : Here the rows of Emp_Table got inserted in Emp Table

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance

In [25]:
SELECT * FROM Emp_Temp

id,name,age,gender,salary,department
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance

In [3]:
-- Method 5 : Inserting data into specific columns

INSERT INTO Emp (id, name, gender)
VALUES (13, 'Aanchal', 'Female')

-- NOTE : For the column names which are not mentioned in above INSERT statement will have NULL values if DEFAULT values are not mentioned.
-- Which in our case while creating table DEFAULT constriants was not used to mention DEFAULT values if data is not provided while inserting.

In [4]:
SELECT * FROM Emp
-- NULL values can be seen in the output

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance
13,Aanchal,NULL,Female,NULL,NULL